Configuration/InformationRegisters/ВерификацияРеквизитовТЧРаспознанныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерификацияРеквизитовТЧРаспознанныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспознанноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспознаваемыеРеквизитыДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/ВерификацияРеквизитовТЧРаспознанныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет запись в регистр
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  ТабличнаяЧасть - Строка
//  НомерСтрокиТЧ - Число
//  ПараметрыПроверки - Структура
Процедура ДобавитьПроверяемыйРеквизит(ДокументСсылка, Знач ИмяРеквизита, Знач ТабличнаяЧасть, Знач НомерСтрокиТЧ, 
		Знач ПараметрыПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыПроверки);
	Запись.Документ = ДокументСсылка;
	Запись.ИмяРеквизита = ИмяРеквизита;
	Запись.ТабличнаяЧасть = ТабличнаяЧасть;
	Запись.НомерСтрокиТЧ = НомерСтрокиТЧ;

	Запись.Записать(Истина);
	
КонецПроцедуры

// Устанавливает статус проверки
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  ТабличнаяЧасть - Строка
//  НомерСтрокиТЧ - Число
//  ПараметрыПроверки - Структура
Процедура УстановитьСтатусПроверкиРеквизита(ДокументСсылка, Знач ИмяРеквизита, Знач ТабличнаяЧасть, Знач НомерСтрокиТЧ, 
		Знач ПараметрыПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Документ", ДокументСсылка);
		Блокировка.Заблокировать();
	
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
		НаборЗаписей.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
		НаборЗаписей.Отбор.ТабличнаяЧасть.Установить(ТабличнаяЧасть);
		НаборЗаписей.Отбор.НомерСтрокиТЧ.Установить(НомерСтрокиТЧ);
			
		НаборЗаписей.Прочитать();
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0], ПараметрыПроверки);
		НаборЗаписей[0].Ответственный = Пользователи.ТекущийПользователь();
		НаборЗаписей[0].ДатаПроверки = ТекущаяДатаСеанса();
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Требует проверки.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Булево - Требует проверки
Функция НеобходимаПроверкиРеквизитовТабличныхЧастей(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Документ
		|ИЗ
		|	РегистрСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов КАК ВерификацияРеквизитовТЧРаспознанныхДокументов
		|ГДЕ
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Документ = &Документ
		|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.ТребуетПроверки = ИСТИНА
		|		И ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен = ЛОЖЬ");
		
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Реквизиты требующие проверки.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ВключаяПроверенные - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция РеквизитыТребующиеПроверки(ДокументСсылка, Знач ВключаяПроверенные = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРеквизита КАК ИмяРеквизита,
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ТабличнаяЧасть КАК ТабличнаяЧасть,
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен КАК Проверен,
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.РаспознанноеЗначение КАК РаспознанноеЗначение
		|ИЗ
		|	РегистрСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов КАК ВерификацияРеквизитовТЧРаспознанныхДокументов
		|ГДЕ
		|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Документ = &Документ
		|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.ТребуетПроверки = ИСТИНА 
		|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен = ЛОЖЬ");
	
	Если ВключаяПроверенные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен = ЛОЖЬ",
			"");
	КонецЕсли;

	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	ТаблицаРеквизитов = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаРеквизитов;
	
КонецФункции

// Необходима проверка реквизита.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  ТабличнаяЧасть - Строка
//  НомерСтроки - Число
// 
// Возвращаемое значение:
//  Булево - Необходима проверка реквизита
Функция НеобходимаПроверкаРеквизита(ДокументСсылка, Знач ИмяРеквизита, Знач ТабличнаяЧасть, Знач НомерСтроки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

		Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРеквизита 
			|ИЗ
			|	РегистрСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов КАК ВерификацияРеквизитовТЧРаспознанныхДокументов
			|ГДЕ
			|	ВерификацияРеквизитовТЧРаспознанныхДокументов.Документ = &Документ
			|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.ИмяРеквизита = &ИмяРеквизита
			|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.ТабличнаяЧасть = &ТабличнаяЧасть
			|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.НомерСтрокиТЧ = &НомерСтроки
			|	И ВерификацияРеквизитовТЧРаспознанныхДокументов.ТребуетПроверки = ИСТИНА
			|		И ВерификацияРеквизитовТЧРаспознанныхДокументов.Проверен = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Удалить данные документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
Процедура УдалитьДанныеДокумента(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
